tap "damascenorafael/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Cross-platform make
brew "cmake"
# GNU compiler collection
brew "gcc"
# Configurable static site generator
brew "hugo"
# C/C++ and Java libraries for Unicode and globalization
brew "icu4c"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# Internet file retriever
brew "wget"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-space-mono-nerd-font"
# Simple menu bar app to view and interact with reminders
cask "reminders-menubar"
vscode "azemoh.one-monokai"
vscode "codeium.codeium"
vscode "davidanson.vscode-markdownlint"
vscode "druideinformatique.antidote"
vscode "eseom.nunjucks-template"
vscode "fortran-lang.linter-gfortran"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "goessner.mdmath"
vscode "julialang.language-julia"
vscode "kortina.vscode-markdown-notes"
vscode "mhutchie.git-graph"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "redhat.vscode-yaml"
vscode "sainnhe.gruvbox-material"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vscodevim.vim"
vscode "wolframresearch.wolfram"
vscode "zhuangtongfa.material-theme"
